#1 Реализовать последовательность {𝐵𝑛} для заданного значения ставки 
# 𝑟 = 0.01, используя формулу (5), за период 𝑁 = 200 при 𝐵0 = 1. Построить
# график;

Bn = 1
N = 200

for(i in 2:N) {
  Bn[i] = 1.01 * Bn[i - 1]
}

plot(Bn, type ='l')

#2 лизовать случайный процесс {𝑆𝑛}, используя формулу (5), при следующих
# значениях параметров: 𝑆0 = 1, 𝑁 = 200, 𝑎 = −0.3, 𝑏 = 0.8, 𝑝 = 0.4.
# Построить график.

Sn = 1
N = 200
a = -0.3
b = 0.8
p = 0.4

for(i in 2:N){
  Sn[i] = (1 + (if(rbinom(1, 1, p) == 1) b else a)) * Sn[i - 1]
}

plot(Sn, type ='l')

#3 Рассчитать справедливую цену 𝑐𝑎𝑙𝑙-опциона по формуле (7) при следующих 
# значениях параметров: 𝑆0 = 100, 𝑁 = 10, 𝑎 = −0.3, 𝑏 = 0.8, 𝑟 = 0.2,
# 𝐾 = 100.

S0 = 100
N = 10
a = -0.3
b = 0.8
r = 0.2
K = 100

K0 = 1 + log(K / (S0 * ((1 + a) ^ N))) * (log((1 + b) / (1 + a))) ^ (-1)
p_tr = (r - a) / (b - a)
p_st = ((1 + b) / (1 + r)) * p_tr

B = function(j, N, p){
  b = 0
  for(k in j:N){
    b = b + (factorial(N) / (factorial(k) * factorial(N - k))) * p ^ k * (1 - p) ^ (N - k)
  }
  return(b)
}

C = S0 * B(K0, N, p_st) - K * ((1 + r) ^ (-N)) * B(K0, N, p_tr)
C
